[
  {
    "_id": "66ec38e31041eea39e896417",
    "title": "Five Tips for a Restful Night",
    "newDate": 1705937080239,
    "img": "https://res.cloudinary.com/dlw7u1u5p/image/upload/v1728483494/ego2kiyavz5rrsthn0jr.jpg",
    "description": [
      {
        "sub_title": "",
        "content": "A good night's sleep is essential for overall well-being. If you've been struggling with restless nights, implementing a few changes to your routine can make a significant difference. Here are five practical tips to help you achieve better sleep and wake up feeling refreshed.<br/>"
      },
      {
        "sub_title": "Establish a Consistent Sleep Schedule:",
        "content": "One of the first steps to better sleep is maintaining a consistent sleep schedule. Going to bed and waking up at the same time every day helps regulate your body's internal clock, making it easier to fall asleep and wake up naturally."
      },
      {
        "sub_title": " Create a Relaxing Bedtime Routine:",
        "content": "Wind down before bedtime with a calming routine. Engage in activities such as reading, taking a warm bath, or practicing relaxation exercises. These habits signal to your body that it's time to unwind and prepare for a restful night.<br/>"
      },
      {
        "sub_title": "Optimize Your Sleep Environment:",
        "content": "Transform your bedroom into a sleep haven. Keep the room cool, dark, and quiet to create an ideal sleeping environment. Invest in a comfortable mattress and pillows that provide the necessary support for a good night's sleep."
      },
      {
        "sub_title": "Limit Screen Time Before Bed:",
        "content": "Reduce exposure to screens at least an hour before bedtime. The blue light emitted from devices can disrupt the production of melatonin, the sleep hormone. Instead, opt for activities that promote relaxation and signal your body that it's time to wind down."
      },
      {
        "sub_title": "Watch Your Diet Before Bed:",
        "content": "Be mindful of your diet in the hours leading up to bedtime. Avoid heavy meals, caffeine, and excessive liquids close to bedtime. Choose a light snack if needed, and aim for a well-balanced diet to support overall sleep quality.<br/>"
      },
      {
        "sub_title": "",
        "content": "Better sleep is within reach by incorporating these simple yet effective tips into your routine. Remember, building healthy sleep habits takes time, so be patient with the process. If sleep troubles persist, consider consulting with a healthcare professional for personalized guidance.<br/>Unlock the key to restful nights and wake up ready to tackle each day with renewed energy. Your well-being starts with a good night's sleep!"
      }
    ],
    "status": "approved",
    "category": "PRIVATEPAY",
    "views": 195
  },
  {
    "_id": "66ec38e31041eea39e896415",
    "title": "Cottage Home Care & Brooklyn Institute: Fostering Change in Caribbean Communities",
    "newDate": 1688744218586,
    "img": "https://res.cloudinary.com/dlw7u1u5p/image/upload/v1728483562/yxgtybtuk585u7fpemhk.jpg",
    "category": "OTHERS",
    "description": [
      {
        "sub_title": "",
        "content": "Navin and Shova, the dedicated team behind Cottage Home Care Services (CHCS) and the Brooklyn Institute of Vocational Training (BIVT), are driven by a shared passion to create positive societal change. Their mission is clear: \"Empower women\" and provide employment opportunities to anyone ready to work."
      },
      {
        "sub_title": "",
        "content": "Navin, originally from Guyana, moved to New York as a teenager and later studied Health Care Administration. After a challenging period during the 2008 recession, Navin became inspired by the homecare industry, recognizing the need for compassionate care. This led him to establish the Brooklyn Institute of Vocational Training in 2019, a vocational school that trains home health aides, offering job placements at CHCS, especially to immigrant women."
      },
      {
        "sub_title": "",
        "content": "In 2020, Navin and Shova acquired Cottage Home Care Services, turning a struggling business into a thriving multimillion-dollar company serving 1,000 patients and employing 1,400 workers. They pride themselves on offering culturally sensitive care to both Caribbean and South Asian immigrant communities."
      },
      {
        "sub_title": "",
        "content": "Their future goals include expanding services to Pennsylvania, opening a senior center for Guyanese in New York, establishing a drug rehab facility, and launching an office in Guyana to meet the growing demand for senior citizen care."
      }
    ],
    "views": 102,
    "status": "rejected"
  },
  {
    "_id": "66ec38e31041eea39e896414",
    "title": "For this Guyanese native, kindness is everything",
    "newDate": 1684779018807,
    "img": "https://res.cloudinary.com/dlw7u1u5p/image/upload/v1728483667/gdoutn6sjifrwp6azdoh.jpg",
    "category": "OTHERS",
    "description": [
      {
        "sub_title": " Navin Shivpal and Nusrat Shova, the leadership behind Cottage Home Care Services (CHCS) and the Brooklyn Institute of Vocational Training (BIVT), are both deeply committed to helping others.",
        "content": "Navin's journey began in Guyana, where he experienced poverty firsthand. After moving to New York at 13, he pursued education in Health Care Administration and entered the homecare industry, motivated by the kindness he witnessed in others."
      },
      {
        "sub_title": "",
        "content": "Shova, who immigrated to the U.S. at 17, faced her own challenges when her father underwent open-heart surgery. This hardship led her to the homecare industry, where she found purpose in caring for others. She and Navin now lead CHCS and BIVT, providing jobs and training, particularly to immigrant women, and creating a supportive environment for their employees."
      },
      {
        "sub_title": "",
        "content": "Together, they have transformed CHCS into a thriving business that serves 1,000 patients and employs 1,400 workers. Their work emphasizes compassionate care and empowering communities, particularly the Caribbean and South Asian populations."
      },
      {
        "sub_title": "",
        "content": "Shova and Navin also have big plans for the future. In addition to their current endeavors, they aim to open a senior center for Guyanese in New York and a drug rehab facility, focusing on creating lasting change for those in need. Their philosophy centers on making an impact today, ensuring that every person they help is treated with respect and dignity."
      }
    ],
    "views": 86,
    "status": "rejected"
  },
  {
    "_id": "66ec38e31041eea39e896413",
    "title": "Businessman aims to employ 1,500 Guyanese at US-based home-care agency by year-end",
    "newDate": 1680210696379,
    "img": "https://res.cloudinary.com/dlw7u1u5p/image/upload/v1728661556/xt2gqqrd04vlgtenybt9.jpg",
    "category": "OTHERS",
    "description": [
      {
        "sub_title": "-plans to open branch here",
        "content": "Article from Guyana Chronicle:<br/><br/>ALTHOUGH it can be difficult for immigrants—in this case, Guyanese—to find employment in the United States of America, Navin Shivpal, the Chief Executive Officer (CEO) of Cottage Home Care Services, wants to give them the opportunity to make a decent livelihood without being exploited.<br/><br/>The Guyanese-owned company currently employs over 700 Guyanese and hopes to have 1,500 on staff by the end of the year.<br/><br/>Shivpal decided to launch his own company in 2020 after becoming disturbed by the adverse conditions in which he witnessed immigrants working.<br/><br/>While things were not always “peaches and rainbows,” the businessman eventually succeeded in turning a failing business into a multimillion-dollar company."
      },
      {
        "sub_title": "",
        "content": "In addition to Cottage Home Care Services, the businessman serves as the head of Brooklyn Institute, a school for vocational training that enrols 90 students per month, the majority of whom are Guyanese.<br/><br/>The vocational training centre quickly gained recognition as multiple videos surfaced of immigrants, specifically Guyanese, receiving their certificates while voicing myriad challenges they faced in the US.<br/><br/>His staff is also multilingual due to the diversity among them; they meet the needs of immigrants from the Caribbean, as well as a significant portion of the South Asian community.<br/><br/>Shivpal declared that he remains dedicated to not only offering the best services, but also the best conditions for his workers and students.<br/><br/>Noting that “success is hard work,” he emphasised that in contrast to some businesses that struggle to pay their employees, he prioritises their welfare because he is aware that these people depend on it in order to live."
      },
      {
        "sub_title": "",
        "content": "When asked how he is able to manage two businesses, he noted that he gets the strength through “love, care, and passion.”<br/><br/>Shivpal also noted that he has an open-door policy and that both his students and staff are welcome to contact him at any time. They even have access to his direct phone number.<br/><br/>The businessman added that despite the large number of students they receive each month, he always introduces himself in order to create a welcoming environment.<br/><br/>Regardless of his students’ background, “I treat them with the same respect and dignity that they deserve,” he said.<br/><br/>The businessman also stated that he cares about his students and wants to give them the necessary resources they need to achieve successful careers.<br/><br/>Shivpal explained that he intends to open an office in Guyana. This idea stemmed from the fact that Guyana is a multicultural society and the market for senior citizen care is not very big, but is in demand.<br/><br/>The businessman also noted that there is much more in the works, as he loves to give back."
      }
    ],
    "date": null,
    "newImg": "https://i.ibb.co/72TGDQP/navin-cover.jpg",
    "views": 67,
    "status": "rejected"
  },
  {
    "_id": "66ec38e31041eea39e896412",
    "title": "Businessman employs 700 Guyanese in New York, seeks to transfer success to Guyana",
    "newDate": 1679616000000,
    "img": "https://res.cloudinary.com/dlw7u1u5p/image/upload/v1728483728/h0hbzpqjossmiruourux.jpg",
    "category": "OTHERS",
    "description": [
      {
        "sub_title": "Businessman and philanthropist Navin Shivpal  ",
        "content": "Article by Newsroom Guyana: '<br/><br/>In January 2020, three months before the start of the COVID-19 lockdown, Guyanese businessman Navin Shivpal acquired an almost bankrupt post hospitalisation care facility in New York city – Cottage Home Care Services – with just 25 patients at the time. Three years later, he has turned the company around and now cares for over 1,000 patients; at the same time, he employs some 1, 200 women, 700 of whom are Guyanese. It is a success story the businessman and philanthropist is most proud of as it amounts to a turnaround of his personal business fortunes also."
      },
      {
        "sub_title": "Shivpal left Guyana in 1995 at the age of 13 looking for a better life in NY",
        "content": "“New York was also tough,” Shivpal recounted as he glossed over his resettling experience during a recent interview with the News Room. By the age of 18, the young businessman along with his brother got into the restaurant business in Florida with two locations of the seafood eatery High Tide.<br/>But a downturn of the economy in 2008 would hurt the business, forcing its closure; a resilient and determined Shivpal turned to healthcare. He later started a training school – Brooklyn Institute of Vocational Training – providing training for hundreds of immigrants, including from Guyana and across the Caribbean, on an annual basis. <br/><br/>Some Guyanese and other Caribbean migrants in the New York undergoing training at the Brooklyn Institute for Vocational Training “Some of them don’t even have a high school education. These are women who come and are in need of a job,” Shivpal said. For just under US$500, the Guyanese businessman has been able to use his facility to certify hundreds of women with a license from the Board of Education."
      },
      {
        "sub_title": "Cottage Home Care Services",
        "content": "And now with Cottage Home Care Services, Shivpal is able to provide employment for these women.<br/>He boasts, “some of my home aids are making US$80,000 a year.” And even at this height, the young businessman says he is not where he wants to be. “There is so much more to get done, so much more to do to help people,” he said. <br/><br/>Apart from his charitable work which is expanding as the business expands, Shivpal is looking to open a senior center for Guyanese in New York. With the property already acquired, he expects to have it up and running in the next three months.<br/><br/>Beyond that, he is also interested in transferring his success to oversee equally successful ventures back home in Guyana one such venture is Care guide Enterprise Inc. In so doing, he is keen to open a senior centre, nursing home and dialysis center but fears the lack of structure for post hospitalisation in Guyana.<br/><br/>Notwithstanding, he is looking to open a back office, similar to a call center, where Guyanese can gain employment and help support his ventures in New York. Shivpal believes the support of his staff and family along with his personal approach is the bedrock of his success"
      }
    ],
    "date": null,
    "views": 63,
    "status": "rejected"
  },
  {
    "_id": "66ec38e31041eea39e896411",
    "title": "Earn up to $21 per hour without a degree as an HHA/PC",
    "date": null,
    "img": "https://res.cloudinary.com/dlw7u1u5p/image/upload/v1728483768/blnwzdny8t3jzxy2buif.webp",
    "category": "HHA",
    "description": [
      {
        "sub_title": "",
        "content": "Most jobs currently pay the minimum wage, regardless of your years of experience. Fortunately, as a certified Home Health Aide or Personable Care Aide, Cottage Home Care Services can offer you a stable and flexible career path in healthcare.Most decent-paying jobs require a degree that will take up to 4 years if you want to make $21 or more per hour. The good news is there are jobs in the healthcare sector where you can make this amount with just a certificate from the Brooklyn Institute of Vocational Training.Cottage Home Care Services is among the top home health care agencies in New York for seniors. We have demonstrated the quality of care and attention we pay to our patients and their loved ones to ensure they receive the benefits they deserve. Our customers and caregivers are prime examples of the standard of care we offer.With offices in Hicksville, Long Island, and Richmond Hill, Queens, New York, we serve most of the boroughs in the New York City area.       "
      },
      {
        "sub_title": "Become a certified HHA through the Brooklyn Institute of Vocational Training ",
        "content": "We offer HHA training to ensure you become a certified Aide through the Brooklyn Institute of Vocational Training, which is the sister company of Cottage Home Care Services. Through our college, you can gain immediate employment and be on your way to becoming successful in the career path of healthcare.The Brooklyn Institute of Vocational Training gives back in many ways to its students and empowers communities throughout New York.We provide a learning atmosphere that will get you ready for the future. Our classes mix hands-on activities with more conventional teaching methods. When it comes to teachers our staff is committed and knowledgeable. Our professors are Registered Nurses with more than 30 years of experience.  "
      },
      {
        "sub_title": "How Important Are HHAs?",
        "content": "For the thousands of Americans living with conditions that require daily care and supervision, the assistance of home health aides (or HHAs) is invaluable.Being able to live at home rather than in a long-term facility or hospital care gives patients who are elderly, physically disabled, terminally ill, or incapable of caring for themselves the opportunity to maintain a significant amount of personal autonomy.With the help of a home health aide (reporting to other medical professionals), a patient can maintain some level of independence and comfort. "
      }
    ],
    "newDate": 1680210605762,
    "views": 24,
    "status": "rejected"
  },
  {
    "_id": "66ec38e31041eea39e896410",
    "title": "Three reasons why you should become a home health aide (HHA)",
    "date": "October 5, 2022",
    "img": "https://res.cloudinary.com/dlw7u1u5p/image/upload/v1728483803/aa5cuie5brwwa3pojvco.webp",
    "category": "HHA",
    "description": [
      {
        "sub_title": "What does an HHA do?",
        "content": "A home health aide helps people who are chronically ill, or disabled and elderly adults who need help with daily activities. HHAs are companions for people who require help getting dressed, bathing, grooming, and doing light housekeeping.Personal care and home health aides are not required to have a degree. If you work for a home health care agency, like Cottage Home Care Services you have to complete formal training through a certified school, like the Brooklyn Insitute of Vocational Training on Liberty Ave, Queens, New York. There are several advantages to working as a HHA or PCA. Here are three specific reasons why you should consider becoming an HHA. "
      },
      {
        "sub_title": "A hero at home",
        "content": "Elder care requires a lot of time, love, and effort. Family members find it difficult to balance a full-time job, kids, and the time needed to care for a loved one. It becomes demanding and more than they can handle. This is where a caretaker comes in to assist families by making sure their loved ones are given love and compassion, which brings them peace of mind. "
      },
      {
        "sub_title": "Help with patient's healing process",
        "content": " Regardless of the client's unique diagnosis, the home health aide is there to provide consistent care in all circumstances. You're there to make your client happy by providing a sympathetic ear or a shoulder to cry on.Every day, home health aides show the world the importance of kindness, love, and strength. You can help those who provide skilled care by providing the human touch and emotional support that a patient needs to recover.You provide a sense of normalcy during what can be a very difficult time, in addition to your kindness, skill, and dependability. As an HHA, you have the ability to improve someone's health and happiness.You can teach and learn something new from your patients. Working as an HHA allows you to be a teacher, a healer, and a source of strength. "
      }
    ],
    "views": 33
  }
]
